--OOPrint("OOInstance")
-- OO instance data

-- public
CAREER_ID = {}
_G.CAREER_ID = CAREER_ID


-- 职业
OOCAREER_WARRIOR = "WARRIOR"  		-- 战士1
OOCAREER_PALADIN = "PALADIN"		-- 圣骑士2
OOCAREER_HUNTER = "HUNTER" 		-- 猎人3
OOCAREER_ROGUE = "ROGUE" 		-- 潜行者4
OOCAREER_PRIEST = "PRIEST" 		-- 牧师5
-- 死亡骑士6
OOCAREER_SHAMAN = "SHAMAN"		-- 萨满7
OOCAREER_MAGE = "MAGE"			-- 法师8
OOCAREER_WARLOCK = "WARLOCK"		-- 术士9
--武僧10
OOCAREER_DRUID = "DRUID"		-- 德鲁伊11
--恶魔猎手12

-- 阵营
OOCAMP_HORDE = "HORDE"
OOCAMP_ALLIANCE = "ALLIANCE"

-- 服务器
OOSERVER = {}



local camp_id = {
	[OOCAMP_HORDE] = "H",
	[OOCAMP_ALLIANCE] = "A"
}


local career_id = {
	[OOCAREER_WARRIOR] = 1,
	[OOCAREER_PALADIN] = 2,
	[OOCAREER_HUNTER] = 3,
	[OOCAREER_ROGUE] = 4,
	[OOCAREER_PRIEST] = 5,
	[OOCAREER_SHAMAN] = 7,
	[OOCAREER_MAGE] = 8,
	[OOCAREER_WARRIOR] = 9,
	[OOCAREER_DRUID] = 11
}
CAREER_ID = career_id


local server_area_1 = {
	[1] = "哈霍兰",
	[2] = "乌洛克",
	[3] = "伊森迪奥斯",
	[4] = "吉兹洛克",
	[5] = "法拉克斯",
	[6] = "萨弗隆",
	[7] = "伦鲁迪洛尔",
	[8] = "光芒",
	[9] = "克罗米",
	[10] = "加丁",
	[11] = "埃提耶什",
	[12] = "奥罗",
	[13] = "奥金斧",
	[14] = "寒脊山小径",
	[15] = "希尔盖",
	[16] = "席瓦莱恩",
	[17] = "德姆塞卡尔",
	[18] = "怀特迈恩",
	[19] = "怒炉",
	[20] = "无畏",
	[21] = "末日之刃",
	[22] = "毁灭之刃",
	[23] = "水晶之牙",
	[24] = "沙尔图拉",
	[25] = "沙顶",
	[26] = "法琳娜",
	[27] = "火锤",
	[28] = "灰烬使者",
	[29] = "碧玉矿洞",
	[30] = "祈福",
	[31] = "维克洛尔",
	[32] = "艾隆纳亚",
	[33] = "莫格莱尼",
	[34] = "萨弗拉斯",
	[35] = "诺格弗格",
	[36] = "辛洛斯",
	[37] = "辛迪加",
	[38] = "震地者",
	[39] = "霜语",
	[40] = "骨火",
	[41] = "黑曜石之锋",
	[42] = "龙之召唤",
	[43] = "龙牙",

}

local server_area_5 = {
	[1] = "安娜斯塔丽",
	[2] = "比格沃斯",
	[3] = "塞卡尔",
	[4] = "塞雷布拉斯",
	[5] = "布劳缪克丝",
	[6] = "弗莱拉斯",
	[7] = "拉姆斯登",
	[8] = "木喉要塞",
	[9] = "维克托",
	[10] = "诺克赛恩",
	[11] = "匕首岭",
	[12] = "卓越",
	[13] = "厄运之槌",
	[14] = "奎尔塞拉",
	[15] = "娅尔罗",
	[16] = "审判",
	[17] = "寒冰之王",
	[18] = "巨人追猎者",
	[19] = "巨龙追猎者",
	[20] = "巴罗夫",
	[21] = "布鲁",
	[22] = "帕奇维克",
	[23] = "无尽风暴",
	[24] = "曼多基尔",
	[25] = "比斯巨兽",
	[26] = "法尔班克斯",
	[27] = "湖畔镇",
	[28] = "灵风",
	[29] = "狂野之刃",
	[30] = "狮心",
	[31] = "碧空之歌",
	[32] = "秩序之源",
	[33] = "维克尼拉斯",
	[34] = "维希度斯",
	[35] = "范克瑞斯",
	[36] = "范沃森",
	[37] = "觅心者",
	[38] = "赫洛德",
	[39] = "迈克斯纳",
	[40] = "阿什坎迪",
	[41] = "阿鲁高",
	[42] = "雷德",
	[43] = "雷霆之击",
}

local server_area_8 = {
	[1] = "圣光之愿",
	[2] = "祖尔格拉布",
	[3] = "神谕林地",
	[4] = "阿拉希盆地",
	[5] = "巨龙沼泽"
}


